DeviceNetworkEvents
| where RemoteUrl contains "cdn.discordapp.com"
| where InitiatingProcessFileName has_any ("cmd.exe", "powershell.exe", "powershell_ise.exe", "wmic.exe")
| where InitiatingProcessParentFileName endswith "wscript.exe"
